windbird-sensor/TD_RF_Module_SDK/lib/Device/EnergyMicro/EFM32LG/Include/ezr32lg230f256.h
/** @} End of group EFM32LG290F256_PRS */



/**************************************************************************//**
 * @defgroup EFM32LG290F256_UNLOCK EFM32LG290F256 Unlock Codes
 * @{
 *****************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EFM32LG290F256_UNLOCK */

/** @} End of group EFM32LG290F256_BitFields */

/**************************************************************************//**
 * @defgroup EFM32LG290F256_Alternate_Function EFM32LG290F256 Alternate Function
 * @{
 *****************************************************************************/

#include "efm32lg_af_ports.h"
#include "efm32lg_af_pins.h"

/** @} End of group EFM32LG290F256_Alternate_Function */

/**************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 *****************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32LG290F256 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif
#endif /* __EFM32LG290F256_H */
